RIOT-OS/RIOT/cpu/StellarisWare/inc/lm4f212h5qc.h
//*****************************************************************************
//
// GPIO registers (PORTE AHB)
//
//*****************************************************************************
#define GPIO_PORTE_AHB_DATA_BITS_R \
                                ((volatile unsigned long *)0x4005C000)
#define GPIO_PORTE_AHB_DATA_R   (*((volatile unsigned long *)0x4005C3FC))
#define GPIO_PORTE_AHB_DIR_R    (*((volatile unsigned long *)0x4005C400))
#define GPIO_PORTE_AHB_IS_R     (*((volatile unsigned long *)0x4005C404))
#define GPIO_PORTE_AHB_IBE_R    (*((volatile unsigned long *)0x4005C408))
#define GPIO_PORTE_AHB_IEV_R    (*((volatile unsigned long *)0x4005C40C))
#define GPIO_PORTE_AHB_IM_R     (*((volatile unsigned long *)0x4005C410))
#define GPIO_PORTE_AHB_RIS_R    (*((volatile unsigned long *)0x4005C414))
#define GPIO_PORTE_AHB_MIS_R    (*((volatile unsigned long *)0x4005C418))
#define GPIO_PORTE_AHB_ICR_R    (*((volatile unsigned long *)0x4005C41C))
#define GPIO_PORTE_AHB_AFSEL_R  (*((volatile unsigned long *)0x4005C420))
#define GPIO_PORTE_AHB_DR2R_R   (*((volatile unsigned long *)0x4005C500))
#define GPIO_PORTE_AHB_DR4R_R   (*((volatile unsigned long *)0x4005C504))
#define GPIO_PORTE_AHB_DR8R_R   (*((volatile unsigned long *)0x4005C508))
#define GPIO_PORTE_AHB_ODR_R    (*((volatile unsigned long *)0x4005C50C))
#define GPIO_PORTE_AHB_PUR_R    (*((volatile unsigned long *)0x4005C510))
#define GPIO_PORTE_AHB_PDR_R    (*((volatile unsigned long *)0x4005C514))
#define GPIO_PORTE_AHB_SLR_R    (*((volatile unsigned long *)0x4005C518))
#define GPIO_PORTE_AHB_DEN_R    (*((volatile unsigned long *)0x4005C51C))
#define GPIO_PORTE_AHB_LOCK_R   (*((volatile unsigned long *)0x4005C520))
#define GPIO_PORTE_AHB_CR_R     (*((volatile unsigned long *)0x4005C524))
#define GPIO_PORTE_AHB_AMSEL_R  (*((volatile unsigned long *)0x4005C528))
#define GPIO_PORTE_AHB_PCTL_R   (*((volatile unsigned long *)0x4005C52C))
#define GPIO_PORTE_AHB_ADCCTL_R (*((volatile unsigned long *)0x4005C530))
#define GPIO_PORTE_AHB_DMACTL_R (*((volatile unsigned long *)0x4005C534))

//*****************************************************************************
//
// GPIO registers (PORTF AHB)
//
//*****************************************************************************
#define GPIO_PORTF_AHB_DATA_BITS_R \
                                ((volatile unsigned long *)0x4005D000)
#define GPIO_PORTF_AHB_DATA_R   (*((volatile unsigned long *)0x4005D3FC))
#define GPIO_PORTF_AHB_DIR_R    (*((volatile unsigned long *)0x4005D400))
#define GPIO_PORTF_AHB_IS_R     (*((volatile unsigned long *)0x4005D404))
#define GPIO_PORTF_AHB_IBE_R    (*((volatile unsigned long *)0x4005D408))
#define GPIO_PORTF_AHB_IEV_R    (*((volatile unsigned long *)0x4005D40C))
#define GPIO_PORTF_AHB_IM_R     (*((volatile unsigned long *)0x4005D410))
#define GPIO_PORTF_AHB_RIS_R    (*((volatile unsigned long *)0x4005D414))
#define GPIO_PORTF_AHB_MIS_R    (*((volatile unsigned long *)0x4005D418))
#define GPIO_PORTF_AHB_ICR_R    (*((volatile unsigned long *)0x4005D41C))
#define GPIO_PORTF_AHB_AFSEL_R  (*((volatile unsigned long *)0x4005D420))
#define GPIO_PORTF_AHB_DR2R_R   (*((volatile unsigned long *)0x4005D500))
#define GPIO_PORTF_AHB_DR4R_R   (*((volatile unsigned long *)0x4005D504))
#define GPIO_PORTF_AHB_DR8R_R   (*((volatile unsigned long *)0x4005D508))
#define GPIO_PORTF_AHB_ODR_R    (*((volatile unsigned long *)0x4005D50C))
#define GPIO_PORTF_AHB_PUR_R    (*((volatile unsigned long *)0x4005D510))
#define GPIO_PORTF_AHB_PDR_R    (*((volatile unsigned long *)0x4005D514))
#define GPIO_PORTF_AHB_SLR_R    (*((volatile unsigned long *)0x4005D518))
#define GPIO_PORTF_AHB_DEN_R    (*((volatile unsigned long *)0x4005D51C))
#define GPIO_PORTF_AHB_LOCK_R   (*((volatile unsigned long *)0x4005D520))
#define GPIO_PORTF_AHB_CR_R     (*((volatile unsigned long *)0x4005D524))
#define GPIO_PORTF_AHB_AMSEL_R  (*((volatile unsigned long *)0x4005D528))
#define GPIO_PORTF_AHB_PCTL_R   (*((volatile unsigned long *)0x4005D52C))
#define GPIO_PORTF_AHB_ADCCTL_R (*((volatile unsigned long *)0x4005D530))
#define GPIO_PORTF_AHB_DMACTL_R (*((volatile unsigned long *)0x4005D534))

//*****************************************************************************
//
// GPIO registers (PORTG AHB)
//
//*****************************************************************************
#define GPIO_PORTG_AHB_DATA_BITS_R \
                                ((volatile unsigned long *)0x4005E000)
#define GPIO_PORTG_AHB_DATA_R   (*((volatile unsigned long *)0x4005E3FC))
#define GPIO_PORTG_AHB_DIR_R    (*((volatile unsigned long *)0x4005E400))
#define GPIO_PORTG_AHB_IS_R     (*((volatile unsigned long *)0x4005E404))
#define GPIO_PORTG_AHB_IBE_R    (*((volatile unsigned long *)0x4005E408))
#define GPIO_PORTG_AHB_IEV_R    (*((volatile unsigned long *)0x4005E40C))
#define GPIO_PORTG_AHB_IM_R     (*((volatile unsigned long *)0x4005E410))
#define GPIO_PORTG_AHB_RIS_R    (*((volatile unsigned long *)0x4005E414))
#define GPIO_PORTG_AHB_MIS_R    (*((volatile unsigned long *)0x4005E418))
#define GPIO_PORTG_AHB_ICR_R    (*((volatile unsigned long *)0x4005E41C))
#define GPIO_PORTG_AHB_AFSEL_R  (*((volatile unsigned long *)0x4005E420))
#define GPIO_PORTG_AHB_DR2R_R   (*((volatile unsigned long *)0x4005E500))
#define GPIO_PORTG_AHB_DR4R_R   (*((volatile unsigned long *)0x4005E504))
#define GPIO_PORTG_AHB_DR8R_R   (*((volatile unsigned long *)0x4005E508))
#define GPIO_PORTG_AHB_ODR_R    (*((volatile unsigned long *)0x4005E50C))
#define GPIO_PORTG_AHB_PUR_R    (*((volatile unsigned long *)0x4005E510))
#define GPIO_PORTG_AHB_PDR_R    (*((volatile unsigned long *)0x4005E514))
#define GPIO_PORTG_AHB_SLR_R    (*((volatile unsigned long *)0x4005E518))
#define GPIO_PORTG_AHB_DEN_R    (*((volatile unsigned long *)0x4005E51C))
#define GPIO_PORTG_AHB_LOCK_R   (*((volatile unsigned long *)0x4005E520))
#define GPIO_PORTG_AHB_CR_R     (*((volatile unsigned long *)0x4005E524))
#define GPIO_PORTG_AHB_AMSEL_R  (*((volatile unsigned long *)0x4005E528))
#define GPIO_PORTG_AHB_PCTL_R   (*((volatile unsigned long *)0x4005E52C))
#define GPIO_PORTG_AHB_ADCCTL_R (*((volatile unsigned long *)0x4005E530))
#define GPIO_PORTG_AHB_DMACTL_R (*((volatile unsigned long *)0x4005E534))

//*****************************************************************************
//
// GPIO registers (PORTH AHB)
//
//*****************************************************************************
#define GPIO_PORTH_AHB_DATA_BITS_R \
                                ((volatile unsigned long *)0x4005F000)
#define GPIO_PORTH_AHB_DATA_R   (*((volatile unsigned long *)0x4005F3FC))
#define GPIO_PORTH_AHB_DIR_R    (*((volatile unsigned long *)0x4005F400))
#define GPIO_PORTH_AHB_IS_R     (*((volatile unsigned long *)0x4005F404))
#define GPIO_PORTH_AHB_IBE_R    (*((volatile unsigned long *)0x4005F408))
#define GPIO_PORTH_AHB_IEV_R    (*((volatile unsigned long *)0x4005F40C))
#define GPIO_PORTH_AHB_IM_R     (*((volatile unsigned long *)0x4005F410))
#define GPIO_PORTH_AHB_RIS_R    (*((volatile unsigned long *)0x4005F414))
#define GPIO_PORTH_AHB_MIS_R    (*((volatile unsigned long *)0x4005F418))
#define GPIO_PORTH_AHB_ICR_R    (*((volatile unsigned long *)0x4005F41C))
#define GPIO_PORTH_AHB_AFSEL_R  (*((volatile unsigned long *)0x4005F420))
#define GPIO_PORTH_AHB_DR2R_R   (*((volatile unsigned long *)0x4005F500))
#define GPIO_PORTH_AHB_DR4R_R   (*((volatile unsigned long *)0x4005F504))
#define GPIO_PORTH_AHB_DR8R_R   (*((volatile unsigned long *)0x4005F508))
#define GPIO_PORTH_AHB_ODR_R    (*((volatile unsigned long *)0x4005F50C))
#define GPIO_PORTH_AHB_PUR_R    (*((volatile unsigned long *)0x4005F510))
#define GPIO_PORTH_AHB_PDR_R    (*((volatile unsigned long *)0x4005F514))
#define GPIO_PORTH_AHB_SLR_R    (*((volatile unsigned long *)0x4005F518))
#define GPIO_PORTH_AHB_DEN_R    (*((volatile unsigned long *)0x4005F51C))
#define GPIO_PORTH_AHB_LOCK_R   (*((volatile unsigned long *)0x4005F520))
#define GPIO_PORTH_AHB_CR_R     (*((volatile unsigned long *)0x4005F524))
#define GPIO_PORTH_AHB_AMSEL_R  (*((volatile unsigned long *)0x4005F528))
#define GPIO_PORTH_AHB_PCTL_R   (*((volatile unsigned long *)0x4005F52C))
#define GPIO_PORTH_AHB_ADCCTL_R (*((volatile unsigned long *)0x4005F530))
#define GPIO_PORTH_AHB_DMACTL_R (*((volatile unsigned long *)0x4005F534))

//*****************************************************************************
//
// GPIO registers (PORTJ AHB)
//
//*****************************************************************************
#define GPIO_PORTJ_AHB_DATA_BITS_R \
                                ((volatile unsigned long *)0x40060000)
#define GPIO_PORTJ_AHB_DATA_R   (*((volatile unsigned long *)0x400603FC))
#define GPIO_PORTJ_AHB_DIR_R    (*((volatile unsigned long *)0x40060400))
#define GPIO_PORTJ_AHB_IS_R     (*((volatile unsigned long *)0x40060404))
#define GPIO_PORTJ_AHB_IBE_R    (*((volatile unsigned long *)0x40060408))
#define GPIO_PORTJ_AHB_IEV_R    (*((volatile unsigned long *)0x4006040C))
#define GPIO_PORTJ_AHB_IM_R     (*((volatile unsigned long *)0x40060410))
#define GPIO_PORTJ_AHB_RIS_R    (*((volatile unsigned long *)0x40060414))
#define GPIO_PORTJ_AHB_MIS_R    (*((volatile unsigned long *)0x40060418))
#define GPIO_PORTJ_AHB_ICR_R    (*((volatile unsigned long *)0x4006041C))
#define GPIO_PORTJ_AHB_AFSEL_R  (*((volatile unsigned long *)0x40060420))
#define GPIO_PORTJ_AHB_DR2R_R   (*((volatile unsigned long *)0x40060500))
#define GPIO_PORTJ_AHB_DR4R_R   (*((volatile unsigned long *)0x40060504))
#define GPIO_PORTJ_AHB_DR8R_R   (*((volatile unsigned long *)0x40060508))
#define GPIO_PORTJ_AHB_ODR_R    (*((volatile unsigned long *)0x4006050C))
#define GPIO_PORTJ_AHB_PUR_R    (*((volatile unsigned long *)0x40060510))
#define GPIO_PORTJ_AHB_PDR_R    (*((volatile unsigned long *)0x40060514))
#define GPIO_PORTJ_AHB_SLR_R    (*((volatile unsigned long *)0x40060518))
#define GPIO_PORTJ_AHB_DEN_R    (*((volatile unsigned long *)0x4006051C))
#define GPIO_PORTJ_AHB_LOCK_R   (*((volatile unsigned long *)0x40060520))
#define GPIO_PORTJ_AHB_CR_R     (*((volatile unsigned long *)0x40060524))
#define GPIO_PORTJ_AHB_AMSEL_R  (*((volatile unsigned long *)0x40060528))
#define GPIO_PORTJ_AHB_PCTL_R   (*((volatile unsigned long *)0x4006052C))
#define GPIO_PORTJ_AHB_ADCCTL_R (*((volatile unsigned long *)0x40060530))
#define GPIO_PORTJ_AHB_DMACTL_R (*((volatile unsigned long *)0x40060534))

//*****************************************************************************
//
// GPIO registers (PORTK)
//
//*****************************************************************************
#define GPIO_PORTK_DATA_BITS_R  ((volatile unsigned long *)0x40061000)
#define GPIO_PORTK_DATA_R       (*((volatile unsigned long *)0x400613FC))
#define GPIO_PORTK_DIR_R        (*((volatile unsigned long *)0x40061400))
#define GPIO_PORTK_IS_R         (*((volatile unsigned long *)0x40061404))
#define GPIO_PORTK_IBE_R        (*((volatile unsigned long *)0x40061408))
#define GPIO_PORTK_IEV_R        (*((volatile unsigned long *)0x4006140C))
#define GPIO_PORTK_IM_R         (*((volatile unsigned long *)0x40061410))
#define GPIO_PORTK_RIS_R        (*((volatile unsigned long *)0x40061414))
#define GPIO_PORTK_MIS_R        (*((volatile unsigned long *)0x40061418))
#define GPIO_PORTK_ICR_R        (*((volatile unsigned long *)0x4006141C))
#define GPIO_PORTK_AFSEL_R      (*((volatile unsigned long *)0x40061420))
#define GPIO_PORTK_DR2R_R       (*((volatile unsigned long *)0x40061500))
#define GPIO_PORTK_DR4R_R       (*((volatile unsigned long *)0x40061504))
#define GPIO_PORTK_DR8R_R       (*((volatile unsigned long *)0x40061508))
#define GPIO_PORTK_ODR_R        (*((volatile unsigned long *)0x4006150C))
#define GPIO_PORTK_PUR_R        (*((volatile unsigned long *)0x40061510))
#define GPIO_PORTK_PDR_R        (*((volatile unsigned long *)0x40061514))
#define GPIO_PORTK_SLR_R        (*((volatile unsigned long *)0x40061518))
#define GPIO_PORTK_DEN_R        (*((volatile unsigned long *)0x4006151C))
#define GPIO_PORTK_LOCK_R       (*((volatile unsigned long *)0x40061520))
#define GPIO_PORTK_CR_R         (*((volatile unsigned long *)0x40061524))
#define GPIO_PORTK_AMSEL_R      (*((volatile unsigned long *)0x40061528))
#define GPIO_PORTK_PCTL_R       (*((volatile unsigned long *)0x4006152C))
#define GPIO_PORTK_ADCCTL_R     (*((volatile unsigned long *)0x40061530))
#define GPIO_PORTK_DMACTL_R     (*((volatile unsigned long *)0x40061534))

//*****************************************************************************
//
// EEPROM registers (EEPROM)
//
//*****************************************************************************
#define EEPROM_EESIZE_R         (*((volatile unsigned long *)0x400AF000))
#define EEPROM_EEBLOCK_R        (*((volatile unsigned long *)0x400AF004))
#define EEPROM_EEOFFSET_R       (*((volatile unsigned long *)0x400AF008))
#define EEPROM_EERDWR_R         (*((volatile unsigned long *)0x400AF010))
#define EEPROM_EERDWRINC_R      (*((volatile unsigned long *)0x400AF014))
#define EEPROM_EEDONE_R         (*((volatile unsigned long *)0x400AF018))
#define EEPROM_EESUPP_R         (*((volatile unsigned long *)0x400AF01C))
#define EEPROM_EEUNLOCK_R       (*((volatile unsigned long *)0x400AF020))
#define EEPROM_EEPROT_R         (*((volatile unsigned long *)0x400AF030))
#define EEPROM_EEPASS0_R        (*((volatile unsigned long *)0x400AF034))
#define EEPROM_EEPASS1_R        (*((volatile unsigned long *)0x400AF038))
#define EEPROM_EEPASS2_R        (*((volatile unsigned long *)0x400AF03C))
#define EEPROM_EEINT_R          (*((volatile unsigned long *)0x400AF040))
#define EEPROM_EEHIDE_R         (*((volatile unsigned long *)0x400AF050))
#define EEPROM_EEDBGME_R        (*((volatile unsigned long *)0x400AF080))
#define EEPROM_PP_R             (*((volatile unsigned long *)0x400AFFC0))

//*****************************************************************************
//
// I2C registers (I2C4 MASTER)
//
//*****************************************************************************
#define I2C4_MASTER_MSA_R       (*((volatile unsigned long *)0x400C0000))
#define I2C4_MASTER_MCS_R       (*((volatile unsigned long *)0x400C0004))
#define I2C4_MASTER_MDR_R       (*((volatile unsigned long *)0x400C0008))
#define I2C4_MASTER_MTPR_R      (*((volatile unsigned long *)0x400C000C))
#define I2C4_MASTER_MIMR_R      (*((volatile unsigned long *)0x400C0010))
#define I2C4_MASTER_MRIS_R      (*((volatile unsigned long *)0x400C0014))
#define I2C4_MASTER_MMIS_R      (*((volatile unsigned long *)0x400C0018))
#define I2C4_MASTER_MICR_R      (*((volatile unsigned long *)0x400C001C))
#define I2C4_MASTER_MCR_R       (*((volatile unsigned long *)0x400C0020))
#define I2C4_MASTER_MCLKOCNT_R  (*((volatile unsigned long *)0x400C0024))
#define I2C4_MASTER_MBMON_R     (*((volatile unsigned long *)0x400C002C))

//*****************************************************************************
//
// I2C registers (I2C4 SLAVE)
//
//*****************************************************************************
#define I2C4_SLAVE_SOAR_R       (*((volatile unsigned long *)0x400C0800))
#define I2C4_SLAVE_SCSR_R       (*((volatile unsigned long *)0x400C0804))
#define I2C4_SLAVE_SDR_R        (*((volatile unsigned long *)0x400C0808))
#define I2C4_SLAVE_SIMR_R       (*((volatile unsigned long *)0x400C080C))
#define I2C4_SLAVE_SRIS_R       (*((volatile unsigned long *)0x400C0810))
#define I2C4_SLAVE_SMIS_R       (*((volatile unsigned long *)0x400C0814))
#define I2C4_SLAVE_SICR_R       (*((volatile unsigned long *)0x400C0818))
#define I2C4_SLAVE_SOAR2_R      (*((volatile unsigned long *)0x400C081C))
#define I2C4_SLAVE_SACKCTL_R    (*((volatile unsigned long *)0x400C0820))

//*****************************************************************************
//
// I2C registers (I2C5 MASTER)
//
//*****************************************************************************
#define I2C5_MASTER_MSA_R       (*((volatile unsigned long *)0x400C1000))
#define I2C5_MASTER_MCS_R       (*((volatile unsigned long *)0x400C1004))
#define I2C5_MASTER_MDR_R       (*((volatile unsigned long *)0x400C1008))
#define I2C5_MASTER_MTPR_R      (*((volatile unsigned long *)0x400C100C))
#define I2C5_MASTER_MIMR_R      (*((volatile unsigned long *)0x400C1010))
#define I2C5_MASTER_MRIS_R      (*((volatile unsigned long *)0x400C1014))
#define I2C5_MASTER_MMIS_R      (*((volatile unsigned long *)0x400C1018))
#define I2C5_MASTER_MICR_R      (*((volatile unsigned long *)0x400C101C))
#define I2C5_MASTER_MCR_R       (*((volatile unsigned long *)0x400C1020))
#define I2C5_MASTER_MCLKOCNT_R  (*((volatile unsigned long *)0x400C1024))
#define I2C5_MASTER_MBMON_R     (*((volatile unsigned long *)0x400C102C))

//*****************************************************************************
//
// I2C registers (I2C5 SLAVE)
//
//*****************************************************************************
#define I2C5_SLAVE_SOAR_R       (*((volatile unsigned long *)0x400C1800))
#define I2C5_SLAVE_SCSR_R       (*((volatile unsigned long *)0x400C1804))
#define I2C5_SLAVE_SDR_R        (*((volatile unsigned long *)0x400C1808))
#define I2C5_SLAVE_SIMR_R       (*((volatile unsigned long *)0x400C180C))
#define I2C5_SLAVE_SRIS_R       (*((volatile unsigned long *)0x400C1810))
#define I2C5_SLAVE_SMIS_R       (*((volatile unsigned long *)0x400C1814))
#define I2C5_SLAVE_SICR_R       (*((volatile unsigned long *)0x400C1818))
#define I2C5_SLAVE_SOAR2_R      (*((volatile unsigned long *)0x400C181C))
#define I2C5_SLAVE_SACKCTL_R    (*((volatile unsigned long *)0x400C1820))

//*****************************************************************************
//
// System Exception Module registers (SYSEXC)
//
//*****************************************************************************
#define SYSEXC_RIS_R            (*((volatile unsigned long *)0x400F9000))
#define SYSEXC_IM_R             (*((volatile unsigned long *)0x400F9004))
#define SYSEXC_MIS_R            (*((volatile unsigned long *)0x400F9008))
#define SYSEXC_IC_R             (*((volatile unsigned long *)0x400F900C))

//*****************************************************************************
//
// Hibernation module registers (HIB)
//
//*****************************************************************************
#define HIB_RTCC_R              (*((volatile unsigned long *)0x400FC000))
#define HIB_RTCM0_R             (*((volatile unsigned long *)0x400FC004))
#define HIB_RTCLD_R             (*((volatile unsigned long *)0x400FC00C))
#define HIB_CTL_R               (*((volatile unsigned long *)0x400FC010))
#define HIB_IM_R                (*((volatile unsigned long *)0x400FC014))
#define HIB_RIS_R               (*((volatile unsigned long *)0x400FC018))
#define HIB_MIS_R               (*((volatile unsigned long *)0x400FC01C))
#define HIB_IC_R                (*((volatile unsigned long *)0x400FC020))
#define HIB_RTCT_R              (*((volatile unsigned long *)0x400FC024))
#define HIB_RTCSS_R             (*((volatile unsigned long *)0x400FC028))
#define HIB_DATA_R              (*((volatile unsigned long *)0x400FC030))

//*****************************************************************************
//
// FLASH registers (FLASH CTRL)
//
//*****************************************************************************
#define FLASH_FMA_R             (*((volatile unsigned long *)0x400FD000))
#define FLASH_FMD_R             (*((volatile unsigned long *)0x400FD004))
#define FLASH_FMC_R             (*((volatile unsigned long *)0x400FD008))
#define FLASH_FCRIS_R           (*((volatile unsigned long *)0x400FD00C))
#define FLASH_FCIM_R            (*((volatile unsigned long *)0x400FD010))
#define FLASH_FCMISC_R          (*((volatile unsigned long *)0x400FD014))
#define FLASH_FMC2_R            (*((volatile unsigned long *)0x400FD020))
#define FLASH_FWBVAL_R          (*((volatile unsigned long *)0x400FD030))
#define FLASH_FWBN_R            (*((volatile unsigned long *)0x400FD100))
#define FLASH_FSIZE_R           (*((volatile unsigned long *)0x400FDFC0))
#define FLASH_SSIZE_R           (*((volatile unsigned long *)0x400FDFC4))
#define FLASH_ROMSWMAP_R        (*((volatile unsigned long *)0x400FDFCC))
#define FLASH_RMCTL_R           (*((volatile unsigned long *)0x400FE0F0))
#define FLASH_BOOTCFG_R         (*((volatile unsigned long *)0x400FE1D0))
#define FLASH_USERREG0_R        (*((volatile unsigned long *)0x400FE1E0))
#define FLASH_USERREG1_R        (*((volatile unsigned long *)0x400FE1E4))
#define FLASH_USERREG2_R        (*((volatile unsigned long *)0x400FE1E8))
#define FLASH_USERREG3_R        (*((volatile unsigned long *)0x400FE1EC))
#define FLASH_FMPRE0_R          (*((volatile unsigned long *)0x400FE200))
#define FLASH_FMPRE1_R          (*((volatile unsigned long *)0x400FE204))
#define FLASH_FMPRE2_R          (*((volatile unsigned long *)0x400FE208))
#define FLASH_FMPRE3_R          (*((volatile unsigned long *)0x400FE20C))
#define FLASH_FMPPE0_R          (*((volatile unsigned long *)0x400FE400))
#define FLASH_FMPPE1_R          (*((volatile unsigned long *)0x400FE404))
#define FLASH_FMPPE2_R          (*((volatile unsigned long *)0x400FE408))
#define FLASH_FMPPE3_R          (*((volatile unsigned long *)0x400FE40C))

